#+TITLE:  Feldman & Cousins expanded table
#+AUTHOR: Xavier Garrido
#+DATE:   26/06/2015


* Table

#+CAPTION: 90% C.L. intervals for the Poisson signal mean \mu, for total events observed
#+CAPTION: n_{evt}, for known mean background n_{bkg} ranging from 0 to 4.9
| n_{evt}/n_{bkg} | 0.0         | 0.1         | 0.2         | 0.3         | 0.4         | 0.5         | 0.6         | 0.7         | 0.8         | 0.9         | 1.0         | 1.1         | 1.2         | 1.3         | 1.4         | 1.5         | 1.6         | 1.7         | 1.8         | 1.9         | 2.0         | 2.1         | 2.2         | 2.3         | 2.4         | 2.5         | 2.6         | 2.7         | 2.8         | 2.9         | 3.0         | 3.1         | 3.2         | 3.3         | 3.4         | 3.5         | 3.6        | 3.7        | 3.8        | 3.9        | 4.0        | 4.1        | 4.2        | 4.3        | 4.4        | 4.5        | 4.6        | 4.7        | 4.8        | 4.9        |
|         0 | 0.00,2.44   | 0.00,2.34   | 0.00,2.24   | 0.00,2.14   | 0.00,2.04   | 0.00,1.94   | 0.00,1.84   | 0.00,1.78   | 0.00,1.72   | 0.00,1.66   | 0.00,1.61   | 0.00,1.55   | 0.00,1.50   | 0.00,1.44   | 0.00,1.39   | 0.00,1.33   | 0.00,1.28   | 0.00,1.26   | 0.00,1.26   | 0.00,1.26   | 0.00,1.26   | 0.00,1.26   | 0.00,1.26   | 0.00,1.26   | 0.00,1.23   | 0.00,1.18   | 0.00,1.13   | 0.00,1.09   | 0.00,1.08   | 0.00,1.08   | 0.00,1.08   | 0.00,1.08   | 0.00,1.08   | 0.00,1.08   | 0.00,1.08   | 0.00,1.06   | 0.00,1.02  | 0.00,1.01  | 0.00,1.01  | 0.00,1.01  | 0.00,1.01  | 0.00,1.01  | 0.00,1.01  | 0.00,1.01  | 0.00,1.00  | 0.00,0.98  | 0.00,0.98  | 0.00,0.98  | 0.00,0.98  | 0.00,0.98  |
|         1 | 0.11,4.36   | 0.01,4.26   | 0.00,4.16   | 0.00,4.06   | 0.00,3.96   | 0.00,3.86   | 0.00,3.76   | 0.00,3.66   | 0.00,3.56   | 0.00,3.46   | 0.00,3.36   | 0.00,3.26   | 0.00,3.17   | 0.00,3.08   | 0.00,2.99   | 0.00,2.91   | 0.00,2.83   | 0.00,2.75   | 0.00,2.67   | 0.00,2.60   | 0.00,2.53   | 0.00,2.46   | 0.00,2.39   | 0.00,2.32   | 0.00,2.25   | 0.00,2.19   | 0.00,2.12   | 0.00,2.06   | 0.00,2.00   | 0.00,1.94   | 0.00,1.88   | 0.00,1.82   | 0.00,1.76   | 0.00,1.70   | 0.00,1.65   | 0.00,1.59   | 0.00,1.54  | 0.00,1.49  | 0.00,1.43  | 0.00,1.39  | 0.00,1.39  | 0.00,1.39  | 0.00,1.39  | 0.00,1.39  | 0.00,1.39  | 0.00,1.39  | 0.00,1.38  | 0.00,1.34  | 0.00,1.29  | 0.00,1.24  |
|         2 | 0.53,5.91   | 0.43,5.81   | 0.33,5.71   | 0.23,5.61   | 0.13,5.51   | 0.03,5.41   | 0.00,5.31   | 0.00,5.21   | 0.00,5.11   | 0.00,5.01   | 0.00,4.91   | 0.00,4.81   | 0.00,4.71   | 0.00,4.61   | 0.00,4.51   | 0.00,4.41   | 0.00,4.31   | 0.00,4.21   | 0.00,4.11   | 0.00,4.01   | 0.00,3.91   | 0.00,3.81   | 0.00,3.72   | 0.00,3.62   | 0.00,3.53   | 0.00,3.45   | 0.00,3.36   | 0.00,3.28   | 0.00,3.19   | 0.00,3.11   | 0.00,3.04   | 0.00,2.96   | 0.00,2.88   | 0.00,2.81   | 0.00,2.74   | 0.00,2.67   | 0.00,2.60  | 0.00,2.53  | 0.00,2.46  | 0.00,2.39  | 0.00,2.33  | 0.00,2.26  | 0.00,2.20  | 0.00,2.14  | 0.00,2.08  | 0.00,2.02  | 0.00,1.96  | 0.00,1.90  | 0.00,1.84  | 0.00,1.78  |
|         3 | 1.10,7.42   | 1.00,7.32   | 0.90,7.22   | 0.80,7.12   | 0.70,7.02   | 0.60,6.92   | 0.50,6.82   | 0.40,6.72   | 0.30,6.62   | 0.20,6.52   | 0.10,6.42   | 0.00,6.32   | 0.00,6.22   | 0.00,6.12   | 0.00,6.02   | 0.00,5.92   | 0.00,5.82   | 0.00,5.72   | 0.00,5.62   | 0.00,5.52   | 0.00,5.42   | 0.00,5.32   | 0.00,5.22   | 0.00,5.12   | 0.00,5.02   | 0.00,4.92   | 0.00,4.82   | 0.00,4.72   | 0.00,4.62   | 0.00,4.52   | 0.00,4.42   | 0.00,4.33   | 0.00,4.23   | 0.00,4.14   | 0.00,4.04   | 0.00,3.95   | 0.00,3.86  | 0.00,3.78  | 0.00,3.69  | 0.00,3.61  | 0.00,3.53  | 0.00,3.45  | 0.00,3.37  | 0.00,3.29  | 0.00,3.21  | 0.00,3.14  | 0.00,3.06  | 0.00,2.99  | 0.00,2.92  | 0.00,2.85  |
|         4 | 1.47,8.60   | 1.41,8.50   | 1.35,8.40   | 1.29,8.30   | 1.23,8.20   | 1.17,8.10   | 1.11,8.00   | 1.04,7.90   | 0.94,7.80   | 0.84,7.70   | 0.74,7.60   | 0.64,7.50   | 0.54,7.40   | 0.44,7.30   | 0.34,7.20   | 0.24,7.10   | 0.14,7.00   | 0.04,6.90   | 0.00,6.80   | 0.00,6.70   | 0.00,6.60   | 0.00,6.50   | 0.00,6.40   | 0.00,6.30   | 0.00,6.20   | 0.00,6.10   | 0.00,6.00   | 0.00,5.90   | 0.00,5.80   | 0.00,5.70   | 0.00,5.60   | 0.00,5.50   | 0.00,5.40   | 0.00,5.30   | 0.00,5.20   | 0.00,5.10   | 0.00,5.00  | 0.00,4.90  | 0.00,4.80  | 0.00,4.70  | 0.00,4.60  | 0.00,4.50  | 0.00,4.40  | 0.00,4.30  | 0.00,4.20  | 0.00,4.10  | 0.00,4.00  | 0.00,3.90  | 0.00,3.80  | 0.00,3.70  |
|         5 | 1.84,9.99   | 1.78,9.89   | 1.71,9.79   | 1.65,9.69   | 1.59,9.59   | 1.53,9.49   | 1.47,9.39   | 1.42,9.29   | 1.36,9.19   | 1.30,9.09   | 1.25,8.99   | 1.19,8.89   | 1.14,8.79   | 1.09,8.69   | 1.03,8.59   | 0.93,8.49   | 0.83,8.39   | 0.73,8.29   | 0.63,8.19   | 0.53,8.09   | 0.43,7.99   | 0.33,7.89   | 0.23,7.79   | 0.13,7.69   | 0.03,7.59   | 0.00,7.49   | 0.00,7.39   | 0.00,7.29   | 0.00,7.19   | 0.00,7.09   | 0.00,6.99   | 0.00,6.89   | 0.00,6.79   | 0.00,6.69   | 0.00,6.59   | 0.00,6.49   | 0.00,6.39  | 0.00,6.29  | 0.00,6.19  | 0.00,6.09  | 0.00,5.99  | 0.00,5.89  | 0.00,5.79  | 0.00,5.69  | 0.00,5.59  | 0.00,5.49  | 0.00,5.39  | 0.00,5.29  | 0.00,5.19  | 0.00,5.09  |
|         6 | 2.21,11.47  | 2.14,11.37  | 2.08,11.27  | 2.02,11.17  | 1.96,11.07  | 1.90,10.97  | 1.84,10.87  | 1.78,10.77  | 1.72,10.67  | 1.66,10.57  | 1.61,10.47  | 1.55,10.37  | 1.50,10.27  | 1.44,10.17  | 1.39,10.07  | 1.33,9.97   | 1.28,9.87   | 1.23,9.77   | 1.18,9.67   | 1.13,9.57   | 1.08,9.47   | 1.03,9.37   | 0.95,9.27   | 0.85,9.17   | 0.75,9.07   | 0.65,8.97   | 0.55,8.87   | 0.45,8.77   | 0.35,8.67   | 0.25,8.57   | 0.15,8.47   | 0.05,8.37   | 0.00,8.27   | 0.00,8.17   | 0.00,8.07   | 0.00,7.97   | 0.00,7.87  | 0.00,7.77  | 0.00,7.67  | 0.00,7.57  | 0.00,7.47  | 0.00,7.37  | 0.00,7.27  | 0.00,7.17  | 0.00,7.07  | 0.00,6.97  | 0.00,6.87  | 0.00,6.77  | 0.00,6.67  | 0.00,6.57  |
|         7 | 3.56,12.53  | 3.46,12.43  | 3.36,12.33  | 3.26,12.23  | 3.16,12.13  | 3.06,12.03  | 2.96,11.93  | 2.86,11.83  | 2.76,11.73  | 2.66,11.63  | 2.56,11.53  | 2.46,11.43  | 2.37,11.33  | 2.28,11.23  | 2.19,11.13  | 2.09,11.03  | 1.99,10.93  | 1.89,10.83  | 1.79,10.73  | 1.69,10.63  | 1.59,10.53  | 1.49,10.43  | 1.39,10.33  | 1.29,10.23  | 1.23,10.13  | 1.18,10.03  | 1.13,9.93   | 1.09,9.83   | 1.04,9.73   | 0.99,9.63   | 0.89,9.53   | 0.79,9.43   | 0.69,9.33   | 0.59,9.23   | 0.49,9.13   | 0.39,9.03   | 0.29,8.93  | 0.19,8.83  | 0.09,8.73  | 0.00,8.63  | 0.00,8.53  | 0.00,8.43  | 0.00,8.33  | 0.00,8.23  | 0.00,8.13  | 0.00,8.03  | 0.00,7.93  | 0.00,7.83  | 0.00,7.73  | 0.00,7.63  |
|         8 | 3.96,13.99  | 3.86,13.89  | 3.76,13.79  | 3.66,13.69  | 3.56,13.59  | 3.46,13.49  | 3.36,13.39  | 3.26,13.29  | 3.16,13.19  | 3.06,13.09  | 2.96,12.99  | 2.86,12.89  | 2.77,12.79  | 2.68,12.69  | 2.60,12.59  | 2.51,12.49  | 2.44,12.39  | 2.36,12.29  | 2.28,12.19  | 2.21,12.09  | 2.14,11.99  | 2.07,11.89  | 2.00,11.79  | 1.93,11.69  | 1.87,11.59  | 1.81,11.49  | 1.74,11.39  | 1.68,11.29  | 1.62,11.19  | 1.56,11.09  | 1.51,10.99  | 1.43,10.89  | 1.33,10.79  | 1.23,10.69  | 1.13,10.59  | 1.06,10.49  | 1.02,10.39 | 0.96,10.29 | 0.86,10.19 | 0.76,10.09 | 0.66,9.99  | 0.56,9.89  | 0.46,9.79  | 0.36,9.69  | 0.26,9.59  | 0.16,9.49  | 0.06,9.39  | 0.00,9.29  | 0.00,9.19  | 0.00,9.09  |
|         9 | 4.36,15.30  | 4.26,15.20  | 4.16,15.10  | 4.06,15.00  | 3.96,14.90  | 3.86,14.80  | 3.76,14.70  | 3.66,14.60  | 3.56,14.50  | 3.46,14.40  | 3.36,14.30  | 3.26,14.20  | 3.17,14.10  | 3.08,14.00  | 2.99,13.90  | 2.91,13.80  | 2.83,13.70  | 2.75,13.60  | 2.67,13.50  | 2.60,13.40  | 2.53,13.30  | 2.46,13.20  | 2.39,13.10  | 2.32,13.00  | 2.25,12.90  | 2.19,12.80  | 2.12,12.70  | 2.06,12.60  | 2.00,12.50  | 1.94,12.40  | 1.88,12.30  | 1.82,12.20  | 1.76,12.10  | 1.70,12.00  | 1.65,11.90  | 1.59,11.80  | 1.54,11.70 | 1.49,11.60 | 1.43,11.50 | 1.38,11.40 | 1.33,11.30 | 1.28,11.20 | 1.18,11.10 | 1.08,11.00 | 1.00,10.90 | 0.93,10.80 | 0.83,10.70 | 0.73,10.60 | 0.63,10.50 | 0.53,10.40 |
|        10 | 5.50,16.50  | 5.40,16.40  | 5.30,16.30  | 5.20,16.20  | 5.10,16.10  | 5.00,16.00  | 4.90,15.90  | 4.80,15.80  | 4.70,15.70  | 4.60,15.60  | 4.50,15.50  | 4.40,15.40  | 4.30,15.30  | 4.20,15.20  | 4.10,15.10  | 4.00,15.00  | 3.90,14.90  | 3.80,14.80  | 3.70,14.70  | 3.60,14.60  | 3.50,14.50  | 3.40,14.40  | 3.31,14.30  | 3.22,14.20  | 3.13,14.10  | 3.04,14.00  | 2.95,13.90  | 2.87,13.80  | 2.79,13.70  | 2.71,13.60  | 2.63,13.50  | 2.56,13.40  | 2.48,13.30  | 2.41,13.20  | 2.34,13.10  | 2.27,13.00  | 2.20,12.90 | 2.13,12.80 | 2.07,12.70 | 2.00,12.60 | 1.94,12.50 | 1.88,12.40 | 1.78,12.30 | 1.68,12.20 | 1.58,12.10 | 1.48,12.00 | 1.38,11.90 | 1.34,11.80 | 1.29,11.70 | 1.24,11.60 |
|        11 | 5.91,17.81  | 5.81,17.71  | 5.71,17.61  | 5.61,17.51  | 5.51,17.41  | 5.41,17.31  | 5.31,17.21  | 5.21,17.11  | 5.11,17.01  | 5.01,16.91  | 4.91,16.81  | 4.81,16.71  | 4.71,16.61  | 4.61,16.51  | 4.51,16.41  | 4.41,16.31  | 4.31,16.21  | 4.21,16.11  | 4.11,16.01  | 4.01,15.91  | 3.91,15.81  | 3.81,15.71  | 3.72,15.61  | 3.62,15.51  | 3.53,15.41  | 3.45,15.31  | 3.36,15.21  | 3.28,15.11  | 3.19,15.01  | 3.11,14.91  | 3.04,14.81  | 2.96,14.71  | 2.88,14.61  | 2.81,14.51  | 2.74,14.41  | 2.67,14.31  | 2.60,14.21 | 2.53,14.11 | 2.46,14.01 | 2.39,13.91 | 2.33,13.81 | 2.26,13.71 | 2.20,13.61 | 2.14,13.51 | 2.08,13.41 | 2.02,13.31 | 1.96,13.21 | 1.90,13.11 | 1.84,13.01 | 1.78,12.91 |
|        12 | 7.01,19.00  | 6.91,18.90  | 6.81,18.80  | 6.71,18.70  | 6.61,18.60  | 6.51,18.50  | 6.41,18.40  | 6.31,18.30  | 6.21,18.20  | 6.11,18.10  | 6.01,18.00  | 5.91,17.90  | 5.81,17.80  | 5.71,17.70  | 5.61,17.60  | 5.51,17.50  | 5.41,17.40  | 5.31,17.30  | 5.21,17.20  | 5.11,17.10  | 5.01,17.00  | 4.91,16.90  | 4.81,16.80  | 4.71,16.70  | 4.61,16.60  | 4.51,16.50  | 4.41,16.40  | 4.31,16.30  | 4.21,16.20  | 4.11,16.10  | 4.01,16.00  | 3.91,15.90  | 3.81,15.80  | 3.72,15.70  | 3.63,15.60  | 3.54,15.50  | 3.45,15.40 | 3.36,15.30 | 3.28,15.20 | 3.20,15.10 | 3.12,15.00 | 3.04,14.90 | 2.96,14.80 | 2.88,14.70 | 2.81,14.60 | 2.73,14.50 | 2.66,14.40 | 2.59,14.30 | 2.52,14.20 | 2.45,14.10 |
|        13 | 7.42,20.05  | 7.32,19.95  | 7.22,19.85  | 7.12,19.75  | 7.02,19.65  | 6.92,19.55  | 6.82,19.45  | 6.72,19.35  | 6.62,19.25  | 6.52,19.15  | 6.42,19.05  | 6.32,18.95  | 6.22,18.85  | 6.12,18.75  | 6.02,18.65  | 5.92,18.55  | 5.82,18.45  | 5.72,18.35  | 5.62,18.25  | 5.52,18.15  | 5.42,18.05  | 5.32,17.95  | 5.22,17.85  | 5.12,17.75  | 5.02,17.65  | 4.92,17.55  | 4.82,17.45  | 4.72,17.35  | 4.62,17.25  | 4.52,17.15  | 4.42,17.05  | 4.33,16.95  | 4.23,16.85  | 4.14,16.75  | 4.04,16.65  | 3.95,16.55  | 3.86,16.45 | 3.78,16.35 | 3.69,16.25 | 3.61,16.15 | 3.53,16.05 | 3.45,15.95 | 3.37,15.85 | 3.29,15.75 | 3.21,15.65 | 3.14,15.55 | 3.06,15.45 | 2.99,15.35 | 2.92,15.25 | 2.85,15.15 |
|        14 | 8.50,21.50  | 8.40,21.40  | 8.30,21.30  | 8.20,21.20  | 8.10,21.10  | 8.00,21.00  | 7.90,20.90  | 7.80,20.80  | 7.70,20.70  | 7.60,20.60  | 7.50,20.50  | 7.40,20.40  | 7.30,20.30  | 7.20,20.20  | 7.10,20.10  | 7.00,20.00  | 6.90,19.90  | 6.80,19.80  | 6.70,19.70  | 6.60,19.60  | 6.50,19.50  | 6.40,19.40  | 6.30,19.30  | 6.20,19.20  | 6.10,19.10  | 6.00,19.00  | 5.90,18.90  | 5.80,18.80  | 5.70,18.70  | 5.60,18.60  | 5.50,18.50  | 5.40,18.40  | 5.30,18.30  | 5.20,18.20  | 5.10,18.10  | 5.00,18.00  | 4.90,17.90 | 4.80,17.80 | 4.70,17.70 | 4.60,17.60 | 4.50,17.50 | 4.40,17.40 | 4.30,17.30 | 4.21,17.20 | 4.12,17.10 | 4.03,17.00 | 3.94,16.90 | 3.85,16.80 | 3.76,16.70 | 3.68,16.60 |
|        15 | 9.48,22.52  | 9.38,22.42  | 9.28,22.32  | 9.18,22.22  | 9.08,22.12  | 8.98,22.02  | 8.88,21.92  | 8.78,21.82  | 8.68,21.72  | 8.58,21.62  | 8.48,21.52  | 8.38,21.42  | 8.28,21.32  | 8.18,21.22  | 8.08,21.12  | 7.98,21.02  | 7.88,20.92  | 7.78,20.82  | 7.68,20.72  | 7.58,20.62  | 7.48,20.52  | 7.38,20.42  | 7.28,20.32  | 7.18,20.22  | 7.08,20.12  | 6.98,20.02  | 6.88,19.92  | 6.78,19.82  | 6.68,19.72  | 6.58,19.62  | 6.48,19.52  | 6.38,19.42  | 6.28,19.32  | 6.18,19.22  | 6.08,19.12  | 5.98,19.02  | 5.88,18.92 | 5.78,18.82 | 5.68,18.72 | 5.58,18.62 | 5.48,18.52 | 5.38,18.42 | 5.28,18.32 | 5.18,18.22 | 5.08,18.12 | 4.98,18.02 | 4.88,17.92 | 4.78,17.82 | 4.68,17.72 | 4.58,17.62 |
|        16 | 9.99,23.99  | 9.89,23.89  | 9.79,23.79  | 9.69,23.69  | 9.59,23.59  | 9.49,23.49  | 9.39,23.39  | 9.29,23.29  | 9.19,23.19  | 9.09,23.09  | 8.99,22.99  | 8.89,22.89  | 8.79,22.79  | 8.69,22.69  | 8.59,22.59  | 8.49,22.49  | 8.39,22.39  | 8.29,22.29  | 8.19,22.19  | 8.09,22.09  | 7.99,21.99  | 7.89,21.89  | 7.79,21.79  | 7.69,21.69  | 7.59,21.59  | 7.49,21.49  | 7.39,21.39  | 7.29,21.29  | 7.19,21.19  | 7.09,21.09  | 6.99,20.99  | 6.89,20.89  | 6.79,20.79  | 6.69,20.69  | 6.59,20.59  | 6.49,20.49  | 6.39,20.39 | 6.29,20.29 | 6.19,20.19 | 6.09,20.09 | 5.99,19.99 | 5.89,19.89 | 5.79,19.79 | 5.69,19.69 | 5.59,19.59 | 5.49,19.49 | 5.39,19.39 | 5.29,19.29 | 5.19,19.19 | 5.09,19.09 |
|        17 | 11.04,25.02 | 10.94,24.92 | 10.84,24.82 | 10.74,24.72 | 10.64,24.62 | 10.54,24.52 | 10.44,24.42 | 10.34,24.32 | 10.24,24.22 | 10.14,24.12 | 10.04,24.02 | 9.94,23.92  | 9.84,23.82  | 9.74,23.72  | 9.64,23.62  | 9.54,23.52  | 9.44,23.42  | 9.34,23.32  | 9.24,23.22  | 9.14,23.12  | 9.04,23.02  | 8.94,22.92  | 8.84,22.82  | 8.74,22.72  | 8.64,22.62  | 8.54,22.52  | 8.44,22.42  | 8.34,22.32  | 8.24,22.22  | 8.14,22.12  | 8.04,22.02  | 7.94,21.92  | 7.84,21.82  | 7.74,21.72  | 7.64,21.62  | 7.54,21.52  | 7.44,21.42 | 7.34,21.32 | 7.24,21.22 | 7.14,21.12 | 7.04,21.02 | 6.94,20.92 | 6.84,20.82 | 6.74,20.72 | 6.64,20.62 | 6.54,20.52 | 6.44,20.42 | 6.34,20.32 | 6.24,20.22 | 6.14,20.12 |
|        18 | 11.47,26.16 | 11.37,26.06 | 11.27,25.96 | 11.17,25.86 | 11.07,25.76 | 10.97,25.66 | 10.87,25.56 | 10.77,25.46 | 10.67,25.36 | 10.57,25.26 | 10.47,25.16 | 10.37,25.06 | 10.27,24.96 | 10.17,24.86 | 10.07,24.76 | 9.97,24.66  | 9.87,24.56  | 9.77,24.46  | 9.67,24.36  | 9.57,24.26  | 9.47,24.16  | 9.37,24.06  | 9.27,23.96  | 9.17,23.86  | 9.07,23.76  | 8.97,23.66  | 8.87,23.56  | 8.77,23.46  | 8.67,23.36  | 8.57,23.26  | 8.47,23.16  | 8.37,23.06  | 8.27,22.96  | 8.17,22.86  | 8.07,22.76  | 7.97,22.66  | 7.87,22.56 | 7.77,22.46 | 7.67,22.36 | 7.57,22.26 | 7.47,22.16 | 7.37,22.06 | 7.27,21.96 | 7.17,21.86 | 7.07,21.76 | 6.97,21.66 | 6.87,21.56 | 6.77,21.46 | 6.67,21.36 | 6.57,21.26 |
|        19 | 12.51,27.51 | 12.41,27.41 | 12.31,27.31 | 12.21,27.21 | 12.11,27.11 | 12.01,27.01 | 11.91,26.91 | 11.81,26.81 | 11.71,26.71 | 11.61,26.61 | 11.51,26.51 | 11.41,26.41 | 11.31,26.31 | 11.21,26.21 | 11.11,26.11 | 11.01,26.01 | 10.91,25.91 | 10.81,25.81 | 10.71,25.71 | 10.61,25.61 | 10.51,25.51 | 10.41,25.41 | 10.31,25.31 | 10.21,25.21 | 10.11,25.11 | 10.01,25.01 | 9.91,24.91  | 9.81,24.81  | 9.71,24.71  | 9.61,24.61  | 9.51,24.51  | 9.41,24.41  | 9.31,24.31  | 9.21,24.21  | 9.11,24.11  | 9.01,24.01  | 8.91,23.91 | 8.81,23.81 | 8.71,23.71 | 8.61,23.61 | 8.51,23.51 | 8.41,23.41 | 8.31,23.31 | 8.21,23.21 | 8.11,23.11 | 8.01,23.01 | 7.91,22.91 | 7.81,22.81 | 7.71,22.71 | 7.61,22.61 |
|        20 | 13.55,28.52 | 13.45,28.42 | 13.35,28.32 | 13.25,28.22 | 13.15,28.12 | 13.05,28.02 | 12.95,27.92 | 12.85,27.82 | 12.75,27.72 | 12.65,27.62 | 12.55,27.52 | 12.45,27.42 | 12.35,27.32 | 12.25,27.22 | 12.15,27.12 | 12.05,27.02 | 11.95,26.92 | 11.85,26.82 | 11.75,26.72 | 11.65,26.62 | 11.55,26.52 | 11.45,26.42 | 11.35,26.32 | 11.25,26.22 | 11.15,26.12 | 11.05,26.02 | 10.95,25.92 | 10.85,25.82 | 10.75,25.72 | 10.65,25.62 | 10.55,25.52 | 10.45,25.42 | 10.35,25.32 | 10.25,25.22 | 10.15,25.12 | 10.05,25.02 | 9.95,24.92 | 9.85,24.82 | 9.75,24.72 | 9.65,24.62 | 9.55,24.52 | 9.45,24.42 | 9.35,24.32 | 9.25,24.22 | 9.15,24.12 | 9.05,24.02 | 8.95,23.92 | 8.85,23.82 | 8.75,23.72 | 8.65,23.62 |

* Code to generate C++ table

#+BEGIN_SRC shell :results raw
  echo "std::vector<std::vector<std::pair<double,double> > > FC_table = {"; cat FC_expanded_table.org | grep '^|' | tail -21 | awk '{print "{";for (i=4;i<=NF;i++) if (i%2 == 0) printf("{%s}%s",$i,(i != NF-1) ? ",":""); print "\n},"}'; echo "};"
#+END_SRC

#+RESULTS:
std::vector<std::vector<std::pair<double,double> > > FC_table = {
{
{0.00,2.44},{0.00,2.34},{0.00,2.24},{0.00,2.14},{0.00,2.04},{0.00,1.94},{0.00,1.84},{0.00,1.78},{0.00,1.72},{0.00,1.66},{0.00,1.61},{0.00,1.55},{0.00,1.50},{0.00,1.44},{0.00,1.39},{0.00,1.33},{0.00,1.28},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.23},{0.00,1.18},{0.00,1.13},{0.00,1.09},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.06},{0.00,1.02},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.00},{0.00,0.98},{0.00,0.98},{0.00,0.98},{0.00,0.98},{0.00,0.98}
},
{
{0.11,4.36},{0.01,4.26},{0.00,4.16},{0.00,4.06},{0.00,3.96},{0.00,3.86},{0.00,3.76},{0.00,3.66},{0.00,3.56},{0.00,3.46},{0.00,3.36},{0.00,3.26},{0.00,3.17},{0.00,3.08},{0.00,2.99},{0.00,2.91},{0.00,2.83},{0.00,2.75},{0.00,2.67},{0.00,2.60},{0.00,2.53},{0.00,2.46},{0.00,2.39},{0.00,2.32},{0.00,2.25},{0.00,2.19},{0.00,2.12},{0.00,2.06},{0.00,2.00},{0.00,1.94},{0.00,1.88},{0.00,1.82},{0.00,1.76},{0.00,1.70},{0.00,1.65},{0.00,1.59},{0.00,1.54},{0.00,1.49},{0.00,1.43},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.38},{0.00,1.34},{0.00,1.29},{0.00,1.24}
},
{
{0.53,5.91},{0.43,5.81},{0.33,5.71},{0.23,5.61},{0.13,5.51},{0.03,5.41},{0.00,5.31},{0.00,5.21},{0.00,5.11},{0.00,5.01},{0.00,4.91},{0.00,4.81},{0.00,4.71},{0.00,4.61},{0.00,4.51},{0.00,4.41},{0.00,4.31},{0.00,4.21},{0.00,4.11},{0.00,4.01},{0.00,3.91},{0.00,3.81},{0.00,3.72},{0.00,3.62},{0.00,3.53},{0.00,3.45},{0.00,3.36},{0.00,3.28},{0.00,3.19},{0.00,3.11},{0.00,3.04},{0.00,2.96},{0.00,2.88},{0.00,2.81},{0.00,2.74},{0.00,2.67},{0.00,2.60},{0.00,2.53},{0.00,2.46},{0.00,2.39},{0.00,2.33},{0.00,2.26},{0.00,2.20},{0.00,2.14},{0.00,2.08},{0.00,2.02},{0.00,1.96},{0.00,1.90},{0.00,1.84},{0.00,1.78}
},
{
{1.10,7.42},{1.00,7.32},{0.90,7.22},{0.80,7.12},{0.70,7.02},{0.60,6.92},{0.50,6.82},{0.40,6.72},{0.30,6.62},{0.20,6.52},{0.10,6.42},{0.00,6.32},{0.00,6.22},{0.00,6.12},{0.00,6.02},{0.00,5.92},{0.00,5.82},{0.00,5.72},{0.00,5.62},{0.00,5.52},{0.00,5.42},{0.00,5.32},{0.00,5.22},{0.00,5.12},{0.00,5.02},{0.00,4.92},{0.00,4.82},{0.00,4.72},{0.00,4.62},{0.00,4.52},{0.00,4.42},{0.00,4.33},{0.00,4.23},{0.00,4.14},{0.00,4.04},{0.00,3.95},{0.00,3.86},{0.00,3.78},{0.00,3.69},{0.00,3.61},{0.00,3.53},{0.00,3.45},{0.00,3.37},{0.00,3.29},{0.00,3.21},{0.00,3.14},{0.00,3.06},{0.00,2.99},{0.00,2.92},{0.00,2.85}
},
{
{1.47,8.60},{1.41,8.50},{1.35,8.40},{1.29,8.30},{1.23,8.20},{1.17,8.10},{1.11,8.00},{1.04,7.90},{0.94,7.80},{0.84,7.70},{0.74,7.60},{0.64,7.50},{0.54,7.40},{0.44,7.30},{0.34,7.20},{0.24,7.10},{0.14,7.00},{0.04,6.90},{0.00,6.80},{0.00,6.70},{0.00,6.60},{0.00,6.50},{0.00,6.40},{0.00,6.30},{0.00,6.20},{0.00,6.10},{0.00,6.00},{0.00,5.90},{0.00,5.80},{0.00,5.70},{0.00,5.60},{0.00,5.50},{0.00,5.40},{0.00,5.30},{0.00,5.20},{0.00,5.10},{0.00,5.00},{0.00,4.90},{0.00,4.80},{0.00,4.70},{0.00,4.60},{0.00,4.50},{0.00,4.40},{0.00,4.30},{0.00,4.20},{0.00,4.10},{0.00,4.00},{0.00,3.90},{0.00,3.80},{0.00,3.70}
},
{
{1.84,9.99},{1.78,9.89},{1.71,9.79},{1.65,9.69},{1.59,9.59},{1.53,9.49},{1.47,9.39},{1.42,9.29},{1.36,9.19},{1.30,9.09},{1.25,8.99},{1.19,8.89},{1.14,8.79},{1.09,8.69},{1.03,8.59},{0.93,8.49},{0.83,8.39},{0.73,8.29},{0.63,8.19},{0.53,8.09},{0.43,7.99},{0.33,7.89},{0.23,7.79},{0.13,7.69},{0.03,7.59},{0.00,7.49},{0.00,7.39},{0.00,7.29},{0.00,7.19},{0.00,7.09},{0.00,6.99},{0.00,6.89},{0.00,6.79},{0.00,6.69},{0.00,6.59},{0.00,6.49},{0.00,6.39},{0.00,6.29},{0.00,6.19},{0.00,6.09},{0.00,5.99},{0.00,5.89},{0.00,5.79},{0.00,5.69},{0.00,5.59},{0.00,5.49},{0.00,5.39},{0.00,5.29},{0.00,5.19},{0.00,5.09}
},
{
{2.21,11.47},{2.14,11.37},{2.08,11.27},{2.02,11.17},{1.96,11.07},{1.90,10.97},{1.84,10.87},{1.78,10.77},{1.72,10.67},{1.66,10.57},{1.61,10.47},{1.55,10.37},{1.50,10.27},{1.44,10.17},{1.39,10.07},{1.33,9.97},{1.28,9.87},{1.23,9.77},{1.18,9.67},{1.13,9.57},{1.08,9.47},{1.03,9.37},{0.95,9.27},{0.85,9.17},{0.75,9.07},{0.65,8.97},{0.55,8.87},{0.45,8.77},{0.35,8.67},{0.25,8.57},{0.15,8.47},{0.05,8.37},{0.00,8.27},{0.00,8.17},{0.00,8.07},{0.00,7.97},{0.00,7.87},{0.00,7.77},{0.00,7.67},{0.00,7.57},{0.00,7.47},{0.00,7.37},{0.00,7.27},{0.00,7.17},{0.00,7.07},{0.00,6.97},{0.00,6.87},{0.00,6.77},{0.00,6.67},{0.00,6.57}
},
{
{3.56,12.53},{3.46,12.43},{3.36,12.33},{3.26,12.23},{3.16,12.13},{3.06,12.03},{2.96,11.93},{2.86,11.83},{2.76,11.73},{2.66,11.63},{2.56,11.53},{2.46,11.43},{2.37,11.33},{2.28,11.23},{2.19,11.13},{2.09,11.03},{1.99,10.93},{1.89,10.83},{1.79,10.73},{1.69,10.63},{1.59,10.53},{1.49,10.43},{1.39,10.33},{1.29,10.23},{1.23,10.13},{1.18,10.03},{1.13,9.93},{1.09,9.83},{1.04,9.73},{0.99,9.63},{0.89,9.53},{0.79,9.43},{0.69,9.33},{0.59,9.23},{0.49,9.13},{0.39,9.03},{0.29,8.93},{0.19,8.83},{0.09,8.73},{0.00,8.63},{0.00,8.53},{0.00,8.43},{0.00,8.33},{0.00,8.23},{0.00,8.13},{0.00,8.03},{0.00,7.93},{0.00,7.83},{0.00,7.73},{0.00,7.63}
},
{
{3.96,13.99},{3.86,13.89},{3.76,13.79},{3.66,13.69},{3.56,13.59},{3.46,13.49},{3.36,13.39},{3.26,13.29},{3.16,13.19},{3.06,13.09},{2.96,12.99},{2.86,12.89},{2.77,12.79},{2.68,12.69},{2.60,12.59},{2.51,12.49},{2.44,12.39},{2.36,12.29},{2.28,12.19},{2.21,12.09},{2.14,11.99},{2.07,11.89},{2.00,11.79},{1.93,11.69},{1.87,11.59},{1.81,11.49},{1.74,11.39},{1.68,11.29},{1.62,11.19},{1.56,11.09},{1.51,10.99},{1.43,10.89},{1.33,10.79},{1.23,10.69},{1.13,10.59},{1.06,10.49},{1.02,10.39},{0.96,10.29},{0.86,10.19},{0.76,10.09},{0.66,9.99},{0.56,9.89},{0.46,9.79},{0.36,9.69},{0.26,9.59},{0.16,9.49},{0.06,9.39},{0.00,9.29},{0.00,9.19},{0.00,9.09}
},
{
{4.36,15.30},{4.26,15.20},{4.16,15.10},{4.06,15.00},{3.96,14.90},{3.86,14.80},{3.76,14.70},{3.66,14.60},{3.56,14.50},{3.46,14.40},{3.36,14.30},{3.26,14.20},{3.17,14.10},{3.08,14.00},{2.99,13.90},{2.91,13.80},{2.83,13.70},{2.75,13.60},{2.67,13.50},{2.60,13.40},{2.53,13.30},{2.46,13.20},{2.39,13.10},{2.32,13.00},{2.25,12.90},{2.19,12.80},{2.12,12.70},{2.06,12.60},{2.00,12.50},{1.94,12.40},{1.88,12.30},{1.82,12.20},{1.76,12.10},{1.70,12.00},{1.65,11.90},{1.59,11.80},{1.54,11.70},{1.49,11.60},{1.43,11.50},{1.38,11.40},{1.33,11.30},{1.28,11.20},{1.18,11.10},{1.08,11.00},{1.00,10.90},{0.93,10.80},{0.83,10.70},{0.73,10.60},{0.63,10.50},{0.53,10.40}
},
{
{5.50,16.50},{5.40,16.40},{5.30,16.30},{5.20,16.20},{5.10,16.10},{5.00,16.00},{4.90,15.90},{4.80,15.80},{4.70,15.70},{4.60,15.60},{4.50,15.50},{4.40,15.40},{4.30,15.30},{4.20,15.20},{4.10,15.10},{4.00,15.00},{3.90,14.90},{3.80,14.80},{3.70,14.70},{3.60,14.60},{3.50,14.50},{3.40,14.40},{3.31,14.30},{3.22,14.20},{3.13,14.10},{3.04,14.00},{2.95,13.90},{2.87,13.80},{2.79,13.70},{2.71,13.60},{2.63,13.50},{2.56,13.40},{2.48,13.30},{2.41,13.20},{2.34,13.10},{2.27,13.00},{2.20,12.90},{2.13,12.80},{2.07,12.70},{2.00,12.60},{1.94,12.50},{1.88,12.40},{1.78,12.30},{1.68,12.20},{1.58,12.10},{1.48,12.00},{1.38,11.90},{1.34,11.80},{1.29,11.70},{1.24,11.60}
},
{
{5.91,17.81},{5.81,17.71},{5.71,17.61},{5.61,17.51},{5.51,17.41},{5.41,17.31},{5.31,17.21},{5.21,17.11},{5.11,17.01},{5.01,16.91},{4.91,16.81},{4.81,16.71},{4.71,16.61},{4.61,16.51},{4.51,16.41},{4.41,16.31},{4.31,16.21},{4.21,16.11},{4.11,16.01},{4.01,15.91},{3.91,15.81},{3.81,15.71},{3.72,15.61},{3.62,15.51},{3.53,15.41},{3.45,15.31},{3.36,15.21},{3.28,15.11},{3.19,15.01},{3.11,14.91},{3.04,14.81},{2.96,14.71},{2.88,14.61},{2.81,14.51},{2.74,14.41},{2.67,14.31},{2.60,14.21},{2.53,14.11},{2.46,14.01},{2.39,13.91},{2.33,13.81},{2.26,13.71},{2.20,13.61},{2.14,13.51},{2.08,13.41},{2.02,13.31},{1.96,13.21},{1.90,13.11},{1.84,13.01},{1.78,12.91}
},
{
{7.01,19.00},{6.91,18.90},{6.81,18.80},{6.71,18.70},{6.61,18.60},{6.51,18.50},{6.41,18.40},{6.31,18.30},{6.21,18.20},{6.11,18.10},{6.01,18.00},{5.91,17.90},{5.81,17.80},{5.71,17.70},{5.61,17.60},{5.51,17.50},{5.41,17.40},{5.31,17.30},{5.21,17.20},{5.11,17.10},{5.01,17.00},{4.91,16.90},{4.81,16.80},{4.71,16.70},{4.61,16.60},{4.51,16.50},{4.41,16.40},{4.31,16.30},{4.21,16.20},{4.11,16.10},{4.01,16.00},{3.91,15.90},{3.81,15.80},{3.72,15.70},{3.63,15.60},{3.54,15.50},{3.45,15.40},{3.36,15.30},{3.28,15.20},{3.20,15.10},{3.12,15.00},{3.04,14.90},{2.96,14.80},{2.88,14.70},{2.81,14.60},{2.73,14.50},{2.66,14.40},{2.59,14.30},{2.52,14.20},{2.45,14.10}
},
{
{7.42,20.05},{7.32,19.95},{7.22,19.85},{7.12,19.75},{7.02,19.65},{6.92,19.55},{6.82,19.45},{6.72,19.35},{6.62,19.25},{6.52,19.15},{6.42,19.05},{6.32,18.95},{6.22,18.85},{6.12,18.75},{6.02,18.65},{5.92,18.55},{5.82,18.45},{5.72,18.35},{5.62,18.25},{5.52,18.15},{5.42,18.05},{5.32,17.95},{5.22,17.85},{5.12,17.75},{5.02,17.65},{4.92,17.55},{4.82,17.45},{4.72,17.35},{4.62,17.25},{4.52,17.15},{4.42,17.05},{4.33,16.95},{4.23,16.85},{4.14,16.75},{4.04,16.65},{3.95,16.55},{3.86,16.45},{3.78,16.35},{3.69,16.25},{3.61,16.15},{3.53,16.05},{3.45,15.95},{3.37,15.85},{3.29,15.75},{3.21,15.65},{3.14,15.55},{3.06,15.45},{2.99,15.35},{2.92,15.25},{2.85,15.15}
},
{
{8.50,21.50},{8.40,21.40},{8.30,21.30},{8.20,21.20},{8.10,21.10},{8.00,21.00},{7.90,20.90},{7.80,20.80},{7.70,20.70},{7.60,20.60},{7.50,20.50},{7.40,20.40},{7.30,20.30},{7.20,20.20},{7.10,20.10},{7.00,20.00},{6.90,19.90},{6.80,19.80},{6.70,19.70},{6.60,19.60},{6.50,19.50},{6.40,19.40},{6.30,19.30},{6.20,19.20},{6.10,19.10},{6.00,19.00},{5.90,18.90},{5.80,18.80},{5.70,18.70},{5.60,18.60},{5.50,18.50},{5.40,18.40},{5.30,18.30},{5.20,18.20},{5.10,18.10},{5.00,18.00},{4.90,17.90},{4.80,17.80},{4.70,17.70},{4.60,17.60},{4.50,17.50},{4.40,17.40},{4.30,17.30},{4.21,17.20},{4.12,17.10},{4.03,17.00},{3.94,16.90},{3.85,16.80},{3.76,16.70},{3.68,16.60}
},
{
{9.48,22.52},{9.38,22.42},{9.28,22.32},{9.18,22.22},{9.08,22.12},{8.98,22.02},{8.88,21.92},{8.78,21.82},{8.68,21.72},{8.58,21.62},{8.48,21.52},{8.38,21.42},{8.28,21.32},{8.18,21.22},{8.08,21.12},{7.98,21.02},{7.88,20.92},{7.78,20.82},{7.68,20.72},{7.58,20.62},{7.48,20.52},{7.38,20.42},{7.28,20.32},{7.18,20.22},{7.08,20.12},{6.98,20.02},{6.88,19.92},{6.78,19.82},{6.68,19.72},{6.58,19.62},{6.48,19.52},{6.38,19.42},{6.28,19.32},{6.18,19.22},{6.08,19.12},{5.98,19.02},{5.88,18.92},{5.78,18.82},{5.68,18.72},{5.58,18.62},{5.48,18.52},{5.38,18.42},{5.28,18.32},{5.18,18.22},{5.08,18.12},{4.98,18.02},{4.88,17.92},{4.78,17.82},{4.68,17.72},{4.58,17.62}
},
{
{9.99,23.99},{9.89,23.89},{9.79,23.79},{9.69,23.69},{9.59,23.59},{9.49,23.49},{9.39,23.39},{9.29,23.29},{9.19,23.19},{9.09,23.09},{8.99,22.99},{8.89,22.89},{8.79,22.79},{8.69,22.69},{8.59,22.59},{8.49,22.49},{8.39,22.39},{8.29,22.29},{8.19,22.19},{8.09,22.09},{7.99,21.99},{7.89,21.89},{7.79,21.79},{7.69,21.69},{7.59,21.59},{7.49,21.49},{7.39,21.39},{7.29,21.29},{7.19,21.19},{7.09,21.09},{6.99,20.99},{6.89,20.89},{6.79,20.79},{6.69,20.69},{6.59,20.59},{6.49,20.49},{6.39,20.39},{6.29,20.29},{6.19,20.19},{6.09,20.09},{5.99,19.99},{5.89,19.89},{5.79,19.79},{5.69,19.69},{5.59,19.59},{5.49,19.49},{5.39,19.39},{5.29,19.29},{5.19,19.19},{5.09,19.09}
},
{
{11.04,25.02},{10.94,24.92},{10.84,24.82},{10.74,24.72},{10.64,24.62},{10.54,24.52},{10.44,24.42},{10.34,24.32},{10.24,24.22},{10.14,24.12},{10.04,24.02},{9.94,23.92},{9.84,23.82},{9.74,23.72},{9.64,23.62},{9.54,23.52},{9.44,23.42},{9.34,23.32},{9.24,23.22},{9.14,23.12},{9.04,23.02},{8.94,22.92},{8.84,22.82},{8.74,22.72},{8.64,22.62},{8.54,22.52},{8.44,22.42},{8.34,22.32},{8.24,22.22},{8.14,22.12},{8.04,22.02},{7.94,21.92},{7.84,21.82},{7.74,21.72},{7.64,21.62},{7.54,21.52},{7.44,21.42},{7.34,21.32},{7.24,21.22},{7.14,21.12},{7.04,21.02},{6.94,20.92},{6.84,20.82},{6.74,20.72},{6.64,20.62},{6.54,20.52},{6.44,20.42},{6.34,20.32},{6.24,20.22},{6.14,20.12}
},
{
{11.47,26.16},{11.37,26.06},{11.27,25.96},{11.17,25.86},{11.07,25.76},{10.97,25.66},{10.87,25.56},{10.77,25.46},{10.67,25.36},{10.57,25.26},{10.47,25.16},{10.37,25.06},{10.27,24.96},{10.17,24.86},{10.07,24.76},{9.97,24.66},{9.87,24.56},{9.77,24.46},{9.67,24.36},{9.57,24.26},{9.47,24.16},{9.37,24.06},{9.27,23.96},{9.17,23.86},{9.07,23.76},{8.97,23.66},{8.87,23.56},{8.77,23.46},{8.67,23.36},{8.57,23.26},{8.47,23.16},{8.37,23.06},{8.27,22.96},{8.17,22.86},{8.07,22.76},{7.97,22.66},{7.87,22.56},{7.77,22.46},{7.67,22.36},{7.57,22.26},{7.47,22.16},{7.37,22.06},{7.27,21.96},{7.17,21.86},{7.07,21.76},{6.97,21.66},{6.87,21.56},{6.77,21.46},{6.67,21.36},{6.57,21.26}
},
{
{12.51,27.51},{12.41,27.41},{12.31,27.31},{12.21,27.21},{12.11,27.11},{12.01,27.01},{11.91,26.91},{11.81,26.81},{11.71,26.71},{11.61,26.61},{11.51,26.51},{11.41,26.41},{11.31,26.31},{11.21,26.21},{11.11,26.11},{11.01,26.01},{10.91,25.91},{10.81,25.81},{10.71,25.71},{10.61,25.61},{10.51,25.51},{10.41,25.41},{10.31,25.31},{10.21,25.21},{10.11,25.11},{10.01,25.01},{9.91,24.91},{9.81,24.81},{9.71,24.71},{9.61,24.61},{9.51,24.51},{9.41,24.41},{9.31,24.31},{9.21,24.21},{9.11,24.11},{9.01,24.01},{8.91,23.91},{8.81,23.81},{8.71,23.71},{8.61,23.61},{8.51,23.51},{8.41,23.41},{8.31,23.31},{8.21,23.21},{8.11,23.11},{8.01,23.01},{7.91,22.91},{7.81,22.81},{7.71,22.71},{7.61,22.61}
},
{
{13.55,28.52},{13.45,28.42},{13.35,28.32},{13.25,28.22},{13.15,28.12},{13.05,28.02},{12.95,27.92},{12.85,27.82},{12.75,27.72},{12.65,27.62},{12.55,27.52},{12.45,27.42},{12.35,27.32},{12.25,27.22},{12.15,27.12},{12.05,27.02},{11.95,26.92},{11.85,26.82},{11.75,26.72},{11.65,26.62},{11.55,26.52},{11.45,26.42},{11.35,26.32},{11.25,26.22},{11.15,26.12},{11.05,26.02},{10.95,25.92},{10.85,25.82},{10.75,25.72},{10.65,25.62},{10.55,25.52},{10.45,25.42},{10.35,25.32},{10.25,25.22},{10.15,25.12},{10.05,25.02},{9.95,24.92},{9.85,24.82},{9.75,24.72},{9.65,24.62},{9.55,24.52},{9.45,24.42},{9.35,24.32},{9.25,24.22},{9.15,24.12},{9.05,24.02},{8.95,23.92},{8.85,23.82},{8.75,23.72},{8.65,23.62}
},
};
std::vector<std::vector<std::pair<double,double> > > FC_table = {
{
{0.00,2.44},{0.00,2.34},{0.00,2.24},{0.00,2.14},{0.00,2.04},{0.00,1.94},{0.00,1.84},{0.00,1.78},{0.00,1.72},{0.00,1.66},{0.00,1.61},{0.00,1.55},{0.00,1.50},{0.00,1.44},{0.00,1.39},{0.00,1.33},{0.00,1.28},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.26},{0.00,1.23},{0.00,1.18},{0.00,1.13},{0.00,1.09},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.08},{0.00,1.06},{0.00,1.02},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.01},{0.00,1.00},{0.00,0.98},{0.00,0.98},{0.00,0.98},{0.00,0.98},{0.00,0.98}
},
{
{0.11,4.36},{0.01,4.26},{0.00,4.16},{0.00,4.06},{0.00,3.96},{0.00,3.86},{0.00,3.76},{0.00,3.66},{0.00,3.56},{0.00,3.46},{0.00,3.36},{0.00,3.26},{0.00,3.17},{0.00,3.08},{0.00,2.99},{0.00,2.91},{0.00,2.83},{0.00,2.75},{0.00,2.67},{0.00,2.60},{0.00,2.53},{0.00,2.46},{0.00,2.39},{0.00,2.32},{0.00,2.25},{0.00,2.19},{0.00,2.12},{0.00,2.06},{0.00,2.00},{0.00,1.94},{0.00,1.88},{0.00,1.82},{0.00,1.76},{0.00,1.70},{0.00,1.65},{0.00,1.59},{0.00,1.54},{0.00,1.49},{0.00,1.43},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.39},{0.00,1.38},{0.00,1.34},{0.00,1.29},{0.00,1.24}
},
{
{0.53,5.91},{0.43,5.81},{0.33,5.71},{0.23,5.61},{0.13,5.51},{0.03,5.41},{0.00,5.31},{0.00,5.21},{0.00,5.11},{0.00,5.01},{0.00,4.91},{0.00,4.81},{0.00,4.71},{0.00,4.61},{0.00,4.51},{0.00,4.41},{0.00,4.31},{0.00,4.21},{0.00,4.11},{0.00,4.01},{0.00,3.91},{0.00,3.81},{0.00,3.72},{0.00,3.62},{0.00,3.53},{0.00,3.45},{0.00,3.36},{0.00,3.28},{0.00,3.19},{0.00,3.11},{0.00,3.04},{0.00,2.96},{0.00,2.88},{0.00,2.81},{0.00,2.74},{0.00,2.67},{0.00,2.60},{0.00,2.53},{0.00,2.46},{0.00,2.39},{0.00,2.33},{0.00,2.26},{0.00,2.20},{0.00,2.14},{0.00,2.08},{0.00,2.02},{0.00,1.96},{0.00,1.90},{0.00,1.84},{0.00,1.78}
},
{
{1.10,7.42},{1.00,7.32},{0.90,7.22},{0.80,7.12},{0.70,7.02},{0.60,6.92},{0.50,6.82},{0.40,6.72},{0.30,6.62},{0.20,6.52},{0.10,6.42},{0.00,6.32},{0.00,6.22},{0.00,6.12},{0.00,6.02},{0.00,5.92},{0.00,5.82},{0.00,5.72},{0.00,5.62},{0.00,5.52},{0.00,5.42},{0.00,5.32},{0.00,5.22},{0.00,5.12},{0.00,5.02},{0.00,4.92},{0.00,4.82},{0.00,4.72},{0.00,4.62},{0.00,4.52},{0.00,4.42},{0.00,4.33},{0.00,4.23},{0.00,4.14},{0.00,4.04},{0.00,3.95},{0.00,3.86},{0.00,3.78},{0.00,3.69},{0.00,3.61},{0.00,3.53},{0.00,3.45},{0.00,3.37},{0.00,3.29},{0.00,3.21},{0.00,3.14},{0.00,3.06},{0.00,2.99},{0.00,2.92},{0.00,2.85}
},
{
{1.47,8.60},{1.41,8.50},{1.35,8.40},{1.29,8.30},{1.23,8.20},{1.17,8.10},{1.11,8.00},{1.04,7.90},{0.94,7.80},{0.84,7.70},{0.74,7.60},{0.64,7.50},{0.54,7.40},{0.44,7.30},{0.34,7.20},{0.24,7.10},{0.14,7.00},{0.04,6.90},{0.00,6.80},{0.00,6.70},{0.00,6.60},{0.00,6.50},{0.00,6.40},{0.00,6.30},{0.00,6.20},{0.00,6.10},{0.00,6.00},{0.00,5.90},{0.00,5.80},{0.00,5.70},{0.00,5.60},{0.00,5.50},{0.00,5.40},{0.00,5.30},{0.00,5.20},{0.00,5.10},{0.00,5.00},{0.00,4.90},{0.00,4.80},{0.00,4.70},{0.00,4.60},{0.00,4.50},{0.00,4.40},{0.00,4.30},{0.00,4.20},{0.00,4.10},{0.00,4.00},{0.00,3.90},{0.00,3.80},{0.00,3.70}
},
{
{1.84,9.99},{1.78,9.89},{1.71,9.79},{1.65,9.69},{1.59,9.59},{1.53,9.49},{1.47,9.39},{1.42,9.29},{1.36,9.19},{1.30,9.09},{1.25,8.99},{1.19,8.89},{1.14,8.79},{1.09,8.69},{1.03,8.59},{0.93,8.49},{0.83,8.39},{0.73,8.29},{0.63,8.19},{0.53,8.09},{0.43,7.99},{0.33,7.89},{0.23,7.79},{0.13,7.69},{0.03,7.59},{0.00,7.49},{0.00,7.39},{0.00,7.29},{0.00,7.19},{0.00,7.09},{0.00,6.99},{0.00,6.89},{0.00,6.79},{0.00,6.69},{0.00,6.59},{0.00,6.49},{0.00,6.39},{0.00,6.29},{0.00,6.19},{0.00,6.09},{0.00,5.99},{0.00,5.89},{0.00,5.79},{0.00,5.69},{0.00,5.59},{0.00,5.49},{0.00,5.39},{0.00,5.29},{0.00,5.19},{0.00,5.09}
},
{
{2.21,11.47},{2.14,11.37},{2.08,11.27},{2.02,11.17},{1.96,11.07},{1.90,10.97},{1.84,10.87},{1.78,10.77},{1.72,10.67},{1.66,10.57},{1.61,10.47},{1.55,10.37},{1.50,10.27},{1.44,10.17},{1.39,10.07},{1.33,9.97},{1.28,9.87},{1.23,9.77},{1.18,9.67},{1.13,9.57},{1.08,9.47},{1.03,9.37},{0.95,9.27},{0.85,9.17},{0.75,9.07},{0.65,8.97},{0.55,8.87},{0.45,8.77},{0.35,8.67},{0.25,8.57},{0.15,8.47},{0.05,8.37},{0.00,8.27},{0.00,8.17},{0.00,8.07},{0.00,7.97},{0.00,7.87},{0.00,7.77},{0.00,7.67},{0.00,7.57},{0.00,7.47},{0.00,7.37},{0.00,7.27},{0.00,7.17},{0.00,7.07},{0.00,6.97},{0.00,6.87},{0.00,6.77},{0.00,6.67},{0.00,6.57}
},
{
{3.56,12.53},{3.46,12.43},{3.36,12.33},{3.26,12.23},{3.16,12.13},{3.06,12.03},{2.96,11.93},{2.86,11.83},{2.76,11.73},{2.66,11.63},{2.56,11.53},{2.46,11.43},{2.37,11.33},{2.28,11.23},{2.19,11.13},{2.09,11.03},{1.99,10.93},{1.89,10.83},{1.79,10.73},{1.69,10.63},{1.59,10.53},{1.49,10.43},{1.39,10.33},{1.29,10.23},{1.23,10.13},{1.18,10.03},{1.13,9.93},{1.09,9.83},{1.04,9.73},{0.99,9.63},{0.89,9.53},{0.79,9.43},{0.69,9.33},{0.59,9.23},{0.49,9.13},{0.39,9.03},{0.29,8.93},{0.19,8.83},{0.09,8.73},{0.00,8.63},{0.00,8.53},{0.00,8.43},{0.00,8.33},{0.00,8.23},{0.00,8.13},{0.00,8.03},{0.00,7.93},{0.00,7.83},{0.00,7.73},{0.00,7.63}
},
{
{3.96,13.99},{3.86,13.89},{3.76,13.79},{3.66,13.69},{3.56,13.59},{3.46,13.49},{3.36,13.39},{3.26,13.29},{3.16,13.19},{3.06,13.09},{2.96,12.99},{2.86,12.89},{2.77,12.79},{2.68,12.69},{2.60,12.59},{2.51,12.49},{2.44,12.39},{2.36,12.29},{2.28,12.19},{2.21,12.09},{2.14,11.99},{2.07,11.89},{2.00,11.79},{1.93,11.69},{1.87,11.59},{1.81,11.49},{1.74,11.39},{1.68,11.29},{1.62,11.19},{1.56,11.09},{1.51,10.99},{1.43,10.89},{1.33,10.79},{1.23,10.69},{1.13,10.59},{1.06,10.49},{1.02,10.39},{0.96,10.29},{0.86,10.19},{0.76,10.09},{0.66,9.99},{0.56,9.89},{0.46,9.79},{0.36,9.69},{0.26,9.59},{0.16,9.49},{0.06,9.39},{0.00,9.29},{0.00,9.19},{0.00,9.09}
},
{
{4.36,15.30},{4.26,15.20},{4.16,15.10},{4.06,15.00},{3.96,14.90},{3.86,14.80},{3.76,14.70},{3.66,14.60},{3.56,14.50},{3.46,14.40},{3.36,14.30},{3.26,14.20},{3.17,14.10},{3.08,14.00},{2.99,13.90},{2.91,13.80},{2.83,13.70},{2.75,13.60},{2.67,13.50},{2.60,13.40},{2.53,13.30},{2.46,13.20},{2.39,13.10},{2.32,13.00},{2.25,12.90},{2.19,12.80},{2.12,12.70},{2.06,12.60},{2.00,12.50},{1.94,12.40},{1.88,12.30},{1.82,12.20},{1.76,12.10},{1.70,12.00},{1.65,11.90},{1.59,11.80},{1.54,11.70},{1.49,11.60},{1.43,11.50},{1.38,11.40},{1.33,11.30},{1.28,11.20},{1.18,11.10},{1.08,11.00},{1.00,10.90},{0.93,10.80},{0.83,10.70},{0.73,10.60},{0.63,10.50},{0.53,10.40}
},
{
{5.50,16.50},{5.40,16.40},{5.30,16.30},{5.20,16.20},{5.10,16.10},{5.00,16.00},{4.90,15.90},{4.80,15.80},{4.70,15.70},{4.60,15.60},{4.50,15.50},{4.40,15.40},{4.30,15.30},{4.20,15.20},{4.10,15.10},{4.00,15.00},{3.90,14.90},{3.80,14.80},{3.70,14.70},{3.60,14.60},{3.50,14.50},{3.40,14.40},{3.31,14.30},{3.22,14.20},{3.13,14.10},{3.04,14.00},{2.95,13.90},{2.87,13.80},{2.79,13.70},{2.71,13.60},{2.63,13.50},{2.56,13.40},{2.48,13.30},{2.41,13.20},{2.34,13.10},{2.27,13.00},{2.20,12.90},{2.13,12.80},{2.07,12.70},{2.00,12.60},{1.94,12.50},{1.88,12.40},{1.78,12.30},{1.68,12.20},{1.58,12.10},{1.48,12.00},{1.38,11.90},{1.34,11.80},{1.29,11.70},{1.24,11.60}
},
{
{5.91,17.81},{5.81,17.71},{5.71,17.61},{5.61,17.51},{5.51,17.41},{5.41,17.31},{5.31,17.21},{5.21,17.11},{5.11,17.01},{5.01,16.91},{4.91,16.81},{4.81,16.71},{4.71,16.61},{4.61,16.51},{4.51,16.41},{4.41,16.31},{4.31,16.21},{4.21,16.11},{4.11,16.01},{4.01,15.91},{3.91,15.81},{3.81,15.71},{3.72,15.61},{3.62,15.51},{3.53,15.41},{3.45,15.31},{3.36,15.21},{3.28,15.11},{3.19,15.01},{3.11,14.91},{3.04,14.81},{2.96,14.71},{2.88,14.61},{2.81,14.51},{2.74,14.41},{2.67,14.31},{2.60,14.21},{2.53,14.11},{2.46,14.01},{2.39,13.91},{2.33,13.81},{2.26,13.71},{2.20,13.61},{2.14,13.51},{2.08,13.41},{2.02,13.31},{1.96,13.21},{1.90,13.11},{1.84,13.01},{1.78,12.91}
},
{
{7.01,19.00},{6.91,18.90},{6.81,18.80},{6.71,18.70},{6.61,18.60},{6.51,18.50},{6.41,18.40},{6.31,18.30},{6.21,18.20},{6.11,18.10},{6.01,18.00},{5.91,17.90},{5.81,17.80},{5.71,17.70},{5.61,17.60},{5.51,17.50},{5.41,17.40},{5.31,17.30},{5.21,17.20},{5.11,17.10},{5.01,17.00},{4.91,16.90},{4.81,16.80},{4.71,16.70},{4.61,16.60},{4.51,16.50},{4.41,16.40},{4.31,16.30},{4.21,16.20},{4.11,16.10},{4.01,16.00},{3.91,15.90},{3.81,15.80},{3.72,15.70},{3.63,15.60},{3.54,15.50},{3.45,15.40},{3.36,15.30},{3.28,15.20},{3.20,15.10},{3.12,15.00},{3.04,14.90},{2.96,14.80},{2.88,14.70},{2.81,14.60},{2.73,14.50},{2.66,14.40},{2.59,14.30},{2.52,14.20},{2.45,14.10}
},
{
{7.42,20.05},{7.32,19.95},{7.22,19.85},{7.12,19.75},{7.02,19.65},{6.92,19.55},{6.82,19.45},{6.72,19.35},{6.62,19.25},{6.52,19.15},{6.42,19.05},{6.32,18.95},{6.22,18.85},{6.12,18.75},{6.02,18.65},{5.92,18.55},{5.82,18.45},{5.72,18.35},{5.62,18.25},{5.52,18.15},{5.42,18.05},{5.32,17.95},{5.22,17.85},{5.12,17.75},{5.02,17.65},{4.92,17.55},{4.82,17.45},{4.72,17.35},{4.62,17.25},{4.52,17.15},{4.42,17.05},{4.33,16.95},{4.23,16.85},{4.14,16.75},{4.04,16.65},{3.95,16.55},{3.86,16.45},{3.78,16.35},{3.69,16.25},{3.61,16.15},{3.53,16.05},{3.45,15.95},{3.37,15.85},{3.29,15.75},{3.21,15.65},{3.14,15.55},{3.06,15.45},{2.99,15.35},{2.92,15.25},{2.85,15.15}
},
{
{8.50,21.50},{8.40,21.40},{8.30,21.30},{8.20,21.20},{8.10,21.10},{8.00,21.00},{7.90,20.90},{7.80,20.80},{7.70,20.70},{7.60,20.60},{7.50,20.50},{7.40,20.40},{7.30,20.30},{7.20,20.20},{7.10,20.10},{7.00,20.00},{6.90,19.90},{6.80,19.80},{6.70,19.70},{6.60,19.60},{6.50,19.50},{6.40,19.40},{6.30,19.30},{6.20,19.20},{6.10,19.10},{6.00,19.00},{5.90,18.90},{5.80,18.80},{5.70,18.70},{5.60,18.60},{5.50,18.50},{5.40,18.40},{5.30,18.30},{5.20,18.20},{5.10,18.10},{5.00,18.00},{4.90,17.90},{4.80,17.80},{4.70,17.70},{4.60,17.60},{4.50,17.50},{4.40,17.40},{4.30,17.30},{4.21,17.20},{4.12,17.10},{4.03,17.00},{3.94,16.90},{3.85,16.80},{3.76,16.70},{3.68,16.60}
},
{
{9.48,22.52},{9.38,22.42},{9.28,22.32},{9.18,22.22},{9.08,22.12},{8.98,22.02},{8.88,21.92},{8.78,21.82},{8.68,21.72},{8.58,21.62},{8.48,21.52},{8.38,21.42},{8.28,21.32},{8.18,21.22},{8.08,21.12},{7.98,21.02},{7.88,20.92},{7.78,20.82},{7.68,20.72},{7.58,20.62},{7.48,20.52},{7.38,20.42},{7.28,20.32},{7.18,20.22},{7.08,20.12},{6.98,20.02},{6.88,19.92},{6.78,19.82},{6.68,19.72},{6.58,19.62},{6.48,19.52},{6.38,19.42},{6.28,19.32},{6.18,19.22},{6.08,19.12},{5.98,19.02},{5.88,18.92},{5.78,18.82},{5.68,18.72},{5.58,18.62},{5.48,18.52},{5.38,18.42},{5.28,18.32},{5.18,18.22},{5.08,18.12},{4.98,18.02},{4.88,17.92},{4.78,17.82},{4.68,17.72},{4.58,17.62}
},
{
{9.99,23.99},{9.89,23.89},{9.79,23.79},{9.69,23.69},{9.59,23.59},{9.49,23.49},{9.39,23.39},{9.29,23.29},{9.19,23.19},{9.09,23.09},{8.99,22.99},{8.89,22.89},{8.79,22.79},{8.69,22.69},{8.59,22.59},{8.49,22.49},{8.39,22.39},{8.29,22.29},{8.19,22.19},{8.09,22.09},{7.99,21.99},{7.89,21.89},{7.79,21.79},{7.69,21.69},{7.59,21.59},{7.49,21.49},{7.39,21.39},{7.29,21.29},{7.19,21.19},{7.09,21.09},{6.99,20.99},{6.89,20.89},{6.79,20.79},{6.69,20.69},{6.59,20.59},{6.49,20.49},{6.39,20.39},{6.29,20.29},{6.19,20.19},{6.09,20.09},{5.99,19.99},{5.89,19.89},{5.79,19.79},{5.69,19.69},{5.59,19.59},{5.49,19.49},{5.39,19.39},{5.29,19.29},{5.19,19.19},{5.09,19.09}
},
{
{11.04,25.02},{10.94,24.92},{10.84,24.82},{10.74,24.72},{10.64,24.62},{10.54,24.52},{10.44,24.42},{10.34,24.32},{10.24,24.22},{10.14,24.12},{10.04,24.02},{9.94,23.92},{9.84,23.82},{9.74,23.72},{9.64,23.62},{9.54,23.52},{9.44,23.42},{9.34,23.32},{9.24,23.22},{9.14,23.12},{9.04,23.02},{8.94,22.92},{8.84,22.82},{8.74,22.72},{8.64,22.62},{8.54,22.52},{8.44,22.42},{8.34,22.32},{8.24,22.22},{8.14,22.12},{8.04,22.02},{7.94,21.92},{7.84,21.82},{7.74,21.72},{7.64,21.62},{7.54,21.52},{7.44,21.42},{7.34,21.32},{7.24,21.22},{7.14,21.12},{7.04,21.02},{6.94,20.92},{6.84,20.82},{6.74,20.72},{6.64,20.62},{6.54,20.52},{6.44,20.42},{6.34,20.32},{6.24,20.22},{6.14,20.12}
},
{
{11.47,26.16},{11.37,26.06},{11.27,25.96},{11.17,25.86},{11.07,25.76},{10.97,25.66},{10.87,25.56},{10.77,25.46},{10.67,25.36},{10.57,25.26},{10.47,25.16},{10.37,25.06},{10.27,24.96},{10.17,24.86},{10.07,24.76},{9.97,24.66},{9.87,24.56},{9.77,24.46},{9.67,24.36},{9.57,24.26},{9.47,24.16},{9.37,24.06},{9.27,23.96},{9.17,23.86},{9.07,23.76},{8.97,23.66},{8.87,23.56},{8.77,23.46},{8.67,23.36},{8.57,23.26},{8.47,23.16},{8.37,23.06},{8.27,22.96},{8.17,22.86},{8.07,22.76},{7.97,22.66},{7.87,22.56},{7.77,22.46},{7.67,22.36},{7.57,22.26},{7.47,22.16},{7.37,22.06},{7.27,21.96},{7.17,21.86},{7.07,21.76},{6.97,21.66},{6.87,21.56},{6.77,21.46},{6.67,21.36},{6.57,21.26}
},
{
{12.51,27.51},{12.41,27.41},{12.31,27.31},{12.21,27.21},{12.11,27.11},{12.01,27.01},{11.91,26.91},{11.81,26.81},{11.71,26.71},{11.61,26.61},{11.51,26.51},{11.41,26.41},{11.31,26.31},{11.21,26.21},{11.11,26.11},{11.01,26.01},{10.91,25.91},{10.81,25.81},{10.71,25.71},{10.61,25.61},{10.51,25.51},{10.41,25.41},{10.31,25.31},{10.21,25.21},{10.11,25.11},{10.01,25.01},{9.91,24.91},{9.81,24.81},{9.71,24.71},{9.61,24.61},{9.51,24.51},{9.41,24.41},{9.31,24.31},{9.21,24.21},{9.11,24.11},{9.01,24.01},{8.91,23.91},{8.81,23.81},{8.71,23.71},{8.61,23.61},{8.51,23.51},{8.41,23.41},{8.31,23.31},{8.21,23.21},{8.11,23.11},{8.01,23.01},{7.91,22.91},{7.81,22.81},{7.71,22.71},{7.61,22.61}
},
{
{13.55,28.52},{13.45,28.42},{13.35,28.32},{13.25,28.22},{13.15,28.12},{13.05,28.02},{12.95,27.92},{12.85,27.82},{12.75,27.72},{12.65,27.62},{12.55,27.52},{12.45,27.42},{12.35,27.32},{12.25,27.22},{12.15,27.12},{12.05,27.02},{11.95,26.92},{11.85,26.82},{11.75,26.72},{11.65,26.62},{11.55,26.52},{11.45,26.42},{11.35,26.32},{11.25,26.22},{11.15,26.12},{11.05,26.02},{10.95,25.92},{10.85,25.82},{10.75,25.72},{10.65,25.62},{10.55,25.52},{10.45,25.42},{10.35,25.32},{10.25,25.22},{10.15,25.12},{10.05,25.02},{9.95,24.92},{9.85,24.82},{9.75,24.72},{9.65,24.62},{9.55,24.52},{9.45,24.42},{9.35,24.32},{9.25,24.22},{9.15,24.12},{9.05,24.02},{8.95,23.92},{8.85,23.82},{8.75,23.72},{8.65,23.62}
},
};
